kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_aes.h
/**
 * @brief       AES-ECB-256 encryption by dma
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   input_key                   The encryption key. must be 16bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 *                                          The buffer size must be larger than the size after padding by 16 byte multiples.
 */
void aes_ecb256_hard_encrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 uint8_t *input_key,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data);

/**
 * @brief       AES-CBC-128 decryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The cbc context to use for encryption or decryption.
 * @param[in]   input_key                   The encryption key. must be 24bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 *                                          The buffer size must be larger than the size after padding by 16 byte multiples.
 */
void aes_cbc128_hard_decrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 cbc_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data);

/**
 * @brief       AES-CBC-128 encryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The cbc context to use for encryption or decryption.
 * @param[in]   input_key                   The encryption key. must be 24bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 *                                          The buffer size must be larger than the size after padding by 16 byte multiples.
 */
void aes_cbc128_hard_encrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 cbc_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data);

/**
 * @brief       AES-CBC-192 decryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The cbc context to use for encryption or decryption.
 * @param[in]   input_key                   The decryption key. must be 24bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 *                                          The buffer size must be larger than the size after padding by 16 byte multiples.
 */
void aes_cbc192_hard_decrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 cbc_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data);

/**
 * @brief       AES-CBC-192 encryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The cbc context to use for encryption or decryption.
 * @param[in]   input_key                   The encryption key. must be 24bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 *                                          The buffer size must be larger than the size after padding by 16 byte multiples.
 */
void aes_cbc192_hard_encrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 cbc_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data);

/**
 * @brief       AES-CBC-256 decryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The cbc context to use for encryption or decryption.
 * @param[in]   input_key                   The decryption key. must be 24bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 *                                          The buffer size must be larger than the size after padding by 16 byte multiples.
 */
void aes_cbc256_hard_decrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 cbc_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data);

/**
 * @brief       AES-CBC-256 encryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The cbc context to use for encryption or decryption.
 * @param[in]   input_key                   The encryption key. must be 24bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 *                                          The buffer size must be larger than the size after padding by 16 byte multiples.
 */
void aes_cbc256_hard_encrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 cbc_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data);

/**
 * @brief       AES-GCM-128 decryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The gcm context to use for encryption or decryption.
 * @param[in]   input_key                   The decryption key. must be 16bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes. Must be 4 byte multiples.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 * @param[out]  gcm_tag                     The buffer for holding the tag.The length of the tag must be 4 bytes.
 */
void aes_gcm128_hard_decrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 gcm_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data,
                                 uint8_t *gcm_tag);

/**
 * @brief       AES-GCM-128 encryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The gcm context to use for encryption or decryption.
 * @param[in]   input_key                   The encryption key. must be 16bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes. Must be 4 byte multiples.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 * @param[out]  gcm_tag                     The buffer for holding the tag.The length of the tag must be 4 bytes.
 */
void aes_gcm128_hard_encrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 gcm_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data,
                                 uint8_t *gcm_tag);

/**
 * @brief       AES-GCM-192 decryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The gcm context to use for encryption or decryption.
 * @param[in]   input_key                   The decryption key. must be 16bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes. Must be 4 byte multiples.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 * @param[out]  gcm_tag                     The buffer for holding the tag.The length of the tag must be 4 bytes.
 */
void aes_gcm192_hard_decrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 gcm_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data,
                                 uint8_t *gcm_tag);

/**
 * @brief       AES-GCM-192 encryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The gcm context to use for encryption or decryption.
 * @param[in]   input_key                   The encryption key. must be 16bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes. Must be 4 byte multiples.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 * @param[out]  gcm_tag                     The buffer for holding the tag.The length of the tag must be 4 bytes.
 */
void aes_gcm192_hard_encrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 gcm_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data,
                                 uint8_t *gcm_tag);

/**
 * @brief       AES-GCM-256 decryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The gcm context to use for encryption or decryption.
 * @param[in]   input_key                   The decryption key. must be 16bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes. Must be 4 byte multiples.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 * @param[out]  gcm_tag                     The buffer for holding the tag.The length of the tag must be 4 bytes.
 */
void aes_gcm256_hard_decrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 gcm_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data,
                                 uint8_t *gcm_tag);

/**
 * @brief       AES-GCM-256 encryption
 *
 * @param[in]   dma_receive_channel_num     Dmac receive channel number.
 * @param[in]   context                     The gcm context to use for encryption or decryption.
 * @param[in]   input_key                   The encryption key. must be 16bytes.
 * @param[in]   input_data                  The buffer holding the input data.
 * @param[in]   input_len                   The length of a data unit in bytes. Must be 4 byte multiples.
 *                                          This can be any length between 16 bytes and 2^31 bytes inclusive
 *                                          (between 1 and 2^27 block cipher blocks).
 * @param[out]  output_data                 The buffer holding the output data.
 * @param[out]  gcm_tag                     The buffer for holding the tag.The length of the tag must be 4 bytes.
 */
void aes_gcm256_hard_encrypt_dma(dmac_channel_number_t dma_receive_channel_num,
                                 gcm_context_t *context,
                                 uint8_t *input_data,
                                 size_t input_len,
                                 uint8_t *output_data,
                                 uint8_t *gcm_tag);

/**
 * @brief       This function initializes the AES hard module.
 *
 * @param[in]   input_key       The buffer holding the encryption or decryption key.
 * @param[in]   input_key_len   The length of the input_key.must be 16bytes || 24bytes || 32bytes.
 * @param[in]   iv              The initialization vector.
 * @param[in]   iv_len          The length of the iv.GCM must be 12bytes. CBC must be 16bytes. ECB set 0L.
 * @param[in]   gcm_aad         The buffer holding the Additional authenticated data. or NULL
 * @param[in]   cipher_mode     Cipher Modes.must be AES_CBC || AES_ECB || AES_GCM.
 *                              Other cipher modes, please look forward to the next generation of kendryte.
 * @param[in]   encrypt_sel     The operation to perform:encryption or decryption.
 * @param[in]   gcm_aad_len     The length of the gcm_aad.
 * @param[in]   input_data_len  The length of the input_data.
 */
void aes_init(uint8_t *input_key, size_t input_key_len, uint8_t *iv, size_t iv_len, uint8_t *gcm_aad,
              aes_cipher_mode_t cipher_mode, aes_encrypt_sel_t encrypt_sel, size_t gcm_aad_len, size_t input_data_len);

/**
 * @brief       This function feeds an input buffer into an encryption or decryption operation.
 *
 * @param[in]   input_data      The buffer holding the input data.
 * @param[out]  output_data     The buffer holding the output data.
 * @param[in]   input_data_len  The length of the input_data.
 * @param[in]   cipher_mode     Cipher Modes.must be AES_CBC || AES_ECB || AES_GCM.
 *                              Other cipher modes, please look forward to the next generation of kendryte.
 */
void aes_process(uint8_t *input_data, uint8_t *output_data, size_t input_data_len, aes_cipher_mode_t cipher_mode);

/**
 * @brief       This function get the gcm tag to verify.
 *
 * @param[out]  gcm_tag         The buffer holding the gcm tag.The length of the tag must be 16bytes.
 */
void gcm_get_tag(uint8_t *gcm_tag);

#ifdef __cplusplus
}
#endif

#endif /* _DRIVER_AES_H */
